nxp-appcodehub/an-bidirectional-acdc-mc56f83783/Multimode_Bidir_DCAC_LCL_MC56F83783/board/pin_mux.c
    /* Initialize GPIO functionality on pin GPIOC15 (pin 56)  */
    GPIO_PinWrite(BOARD_CAN_STB_GPIO, BOARD_CAN_STB_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_CAN_STB_GPIO, BOARD_CAN_STB_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOE2 (pin 47)  */
    GPIO_PinWrite(BOARD_PWM4_GPIO, BOARD_PWM4_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_PWM4_GPIO, BOARD_PWM4_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOE3 (pin 48)  */
    GPIO_PinWrite(BOARD_PWM3_GPIO, BOARD_PWM3_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_PWM3_GPIO, BOARD_PWM3_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF0 (pin 36)  */
    GPIO_PinWrite(BOARD_TP40_GPIO, BOARD_TP40_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_TP40_GPIO, BOARD_TP40_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF2 (pin 39)  */
    GPIO_PinWrite(BOARD_user_LED2_GPIO, BOARD_user_LED2_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_user_LED2_GPIO, BOARD_user_LED2_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF3 (pin 40)  */
    GPIO_PinWrite(BOARD_SW_GRID_GPIO, BOARD_SW_GRID_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_SW_GRID_GPIO, BOARD_SW_GRID_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF6 (pin 58)  */
    GPIO_PinWrite(BOARD_SW_L_GPIO, BOARD_SW_L_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_SW_L_GPIO, BOARD_SW_L_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF7 (pin 59)  */
    GPIO_PinWrite(BOARD_SW_N_GPIO, BOARD_SW_N_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_SW_N_GPIO, BOARD_SW_N_PIN_MASK, kGPIO_DigitalOutput);

    /* Internal Peripheral Select */
    /* Select PWMA Fault 0 Input.: Select PWMA Fault 0 Input, XB_OUT29. */
    SIM_SetInternalPeriInput(SIM, kSIM_PWMAFault0InputIndex, kSIM_PWMAFault0Input_XB_OUT29);
    /* Select PWMA Fault 1 Input.: Select PWMA Fault 1 Input, XB_OUT30. */
    SIM_SetInternalPeriInput(SIM, kSIM_PWMAFault1InputIndex, kSIM_PWMAFault1Input_XB_OUT30);
    /* Select PWMA Fault 2 Input.: Select PWMA Fault 2 Input, XB_OUT31. */
    SIM_SetInternalPeriInput(SIM, kSIM_PWMAFault2InputIndex, kSIM_PWMAFault2Input_XB_OUT31);

    /* PWM Select */
    /* xbar input 28.: xbar input 28, PWMA0_OUT_TRIG0. */
    SIM_SetXbarInputPWMSelection(SIM, kSIM_XBARIN28Index, kSIM_XbarIn28PWMA0OutTrig0);

    /* CMPA_OUT output assigned to XBARA_IN12 input is connected
     * to XBARA_OUT29 output assigned to PWMA_PWMB_FAULT0 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpaOut, kXBARA_OutputPwmaPwmbFault0);
    /* CMPB_OUT output assigned to XBARA_IN13 input is connected
     * to XBARA_OUT30 output assigned to PWMA_PWMB_FAULT1 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpbOut, kXBARA_OutputPwmaPwmbFault1);
    /* CMPC_OUT output assigned to XBARA_IN14 input is connected
     * to XBARA_OUT31 output assigned to PWMA_PWMB_FAULT2 */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputCmpcOut, kXBARA_OutputPwmaPwmbFault2);
    /* PWMB0_MUX_PWMA0_OUT_TRIG0 output assigned to XBARA_IN28 input is connected
     * to XBARA_OUT12 output assigned to ADCA_SYNC */
    XBARA_SetSignalsConnection(XBARA, kXBARA_InputPwmb0MuxPwma0OutTrig0, kXBARA_OutputAdcaSync);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
